'''Website'''
import streamlit as st

page = st.sidebar.radio('首页',['兴趣推荐','图片处理','词典','留言'])

def page1():
    '''兴趣推荐'''
    st.write('Game')
    st.write('----Minecraft')
    st.write('------------------------------------------------------')
    st.write('----Steam')
    st.write('------------------------------------------------------')
    st.write('----吃鸡')
    st.write('------------------------------------------------------')
    st.write('----王者')
    st.write('------------------------------------------------------')
    st.write('----元气骑士')
    st.write('------------------------------------------------------')
    st.write('----暗区')
    st.write('------------------------------------------------------')
    
def page2():
    '''图片处理'''
    pass
    
def page3():
    '''词典'''
    pass
    
def page4():
    '''留言'''
    pass

if page == '兴趣推荐':
    page1()
elif page == '图片处理':
    page2()
elif page == '词典':
    page3()
elif page == '留言':
    page4()